/*Напишите функцию setbits(x, p, n, y), возвращающую значение x, в котором n
битов, начиная с p-й позиции, заменены на n правых разрядов из y (остальные биты не изменяются)*/

// void setbits(x, p, n, y){
//   unsigned getbits(unsigned х, int p, int n)
// {
// return (x >> (p+1-n)) & ~(~0 << n);}
// };;l;;;
#include<stdio.h>

int main(){
  int n;
  n = n & 107;
  printf("%d\n" ,n);
}
