#include <stdio.h>
 

int max(int num1, int num2);erf
 
int main () {
   int a = 100;/*ініціалізація змінної*/
   int b = 200;/*ініціалізація змінної*/
   int ret;/*оголошення змінної*/
   ret = max(a, b);/*присвоювання змінної ret значення функції max*/ 
                                                                                         
                                                                                           
   return 0;                                                                               
}                                                                                         
int max(int num1, int num2) { /*ініціалізація функціЇ та ЇЇ повертающего значення */      
                                                                                           
   int result;/*оголошення змінної*/                                                       
                                                                                           
   if (num1 > num2)/*оператор розгалуження та задання аргументів виконування*/             
      result = num1;/*присвоювання змінної result значення змінної num1*/                 
   else/*оцінка протележного  результата*/                                                
      result = num2;/*присвоювання змінної result значення змінної num1*/                
                                                                                          
   return result; /*return обозначає яке значення буде повертать данна функція*/
